SunCity/src/AccumulationRegisters/ДенежныеСредстваККМ/ДенежныеСредстваККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваККМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SunCity/src/AccumulationRegisters/ДенежныеСредстваККМ/RecordSetModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСервер.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяКонтроль = НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(
							ПланыВидовХарактеристик.ПраваПользователей.РазрешитьПревышениеСвободногоОстаткаДС,
							Ложь);

	Если НЕ ТребуетсяКонтроль Тогда
		ДополнительныеСвойства.РассчитыватьИзменения = Ложь;
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	БлокироватьДляИзменения = Истина;

	// Текущее состояние набора помещается во временную таблицу "ДенежныеСредстваККМ",
	// чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый", ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.КассаККМ,
	|	Таблица.ДоговорКонтрагента,
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Таблица.Сумма
	|		ИНАЧЕ -Таблица.Сумма
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ДвиженияДенежныеСредстваККМПередЗаписью
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваККМ КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСервер.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;

	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаИзменений.КассаККМ,
	|	ТаблицаИзменений.ДоговорКонтрагента,
	|	СУММА(ТаблицаИзменений.Сумма) КАК СуммаИзменение
	|ПОМЕСТИТЬ ДвиженияДенежныеСредстваККМИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПередЗаписью.КассаККМ КАК КассаККМ,
	|		ТаблицаПередЗаписью.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ТаблицаПередЗаписью.Сумма КАК Сумма
	|	ИЗ
	|		ДвиженияДенежныеСредстваККМПередЗаписью КАК ТаблицаПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаПриЗаписи.КассаККМ,
	|		ТаблицаПриЗаписи.ДоговорКонтрагента,
	|		ВЫБОР
	|			КОГДА ТаблицаПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ТаблицаПриЗаписи.Сумма
	|			ИНАЧЕ ТаблицаПриЗаписи.Сумма
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ДенежныеСредстваККМ КАК ТаблицаПриЗаписи
	|	ГДЕ
	|		ТаблицаПриЗаписи.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.КассаККМ,
	|	ТаблицаИзменений.ДоговорКонтрагента
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.Сумма) > 0
	|;
	|ВЫБРАТЬ * ИЗ ДвиженияДенежныеСредстваККМПередЗаписью;
	|ВЫБРАТЬ * ИЗ РегистрНакопления.ДенежныеСредстваККМ КАК ТаблицаПриЗаписи
	|	ГДЕ
	|		ТаблицаПриЗаписи.Регистратор = &Регистратор;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияДенежныеСредстваККМПередЗаписью";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	Т0 = РезультатЗапроса[0].Выгрузить();
	Т1 = РезультатЗапроса[1].Выгрузить();
	Т3 = РезультатЗапроса[2].Выгрузить();
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияДенежныеСредстваККМИзменение", Выборка.Количество > 0);
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
